package Util;

import java.util.Scanner;

public class PrintUtil {
	static public void menuBar1() {
		System.out.println("                        _       _ ");
		System.out.println("                       ( \\     / )     _________________");
		System.out.println("                        \\ \\___/ /     | 메뉴 골라 주시술...?  |");
		System.out.println("                         ) . . (      |/────────────────   ");
		System.out.println("___________________,--._(___Y___)_,--.______________________________");
		System.out.println("                   `--'           `--'");
		System.out.println("  _______   ________   __________   ___________   _______   ________");
		System.out.println(" ║  커피     ║ ║  논커피    ║ ║ 에이드&모히또 ║ ║ 스무디&프라페  ║ ║   차       ║ ║  디저트    ║");
		System.out.println("     1         2            3            4           5          6  ");
		System.out.println(" ───────────────────────────────────────────────────────────────────\n");
		System.out.print(" ᐳᐳ  ");
	}
	
	static public void menuBar3() {
		System.out.println("                        _       _ ");
		System.out.println("                       ( \\     / )     ____________________");
		System.out.println("                        \\ \\___/ /     | 메뉴 다시 골라 주시술...?  |");
		System.out.println("                         ) . . (      |/───────────────────   ");
		System.out.println("___________________,--._(___Y___)_,--.______________________________");
		System.out.println("  _______   ________   __________   ___________   _______   ________");
		System.out.println(" ║  커피     ║ ║  논커피    ║ ║ 에이드&모히또 ║ ║ 스무디&프라페  ║ ║   차       ║ ║  디저트    ║");
		System.out.println("     1         2            3            4           5          6  ");
		System.out.println(" ───────────────────────────────────────────────────────────────────\n");
		System.out.print(" ᐳᐳ  ");
	}
	
	static public void coffee() {
		System.out.println("                        _       _ ");
		System.out.println("                       ( \\     / )     _________________");
		System.out.println("                        \\ \\___/ /     |       커피                 |");
		System.out.println("                         ) . . (      |/────────────────   ");
		System.out.println("___________________,--._(___Y___)_,--.______________________________");
		System.out.println("  _______   ________   __________   ___________   _______   ________");
		System.out.println(" ║  커피     ║ ║  논커피    ║ ║ 에이드&모히또 ║ ║ 스무디&프라페  ║ ║   차       ║ ║  디저트    ║");
		System.out.println("     1         2            3            4           5          6  ");
		System.out.println(" ───────────────────────────────────────────────────────────────────\n");
	}
	
	static public void nonCoffee() {
		System.out.println("                        _       _ ");
		System.out.println("                       ( \\     / )     _________________");
		System.out.println("                        \\ \\___/ /     |       논커피              |");
		System.out.println("                         ) . . (      |/────────────────   ");
		System.out.println("___________________,--._(___Y___)_,--.______________________________");
		System.out.println("  _______   ________   __________   ___________   _______   ________");
		System.out.println(" ║  커피     ║ ║  논커피    ║ ║ 에이드&모히또 ║ ║ 스무디&프라페  ║ ║   차       ║ ║  디저트    ║");
		System.out.println("     1         2            3            4           5          6  ");
		System.out.println(" ───────────────────────────────────────────────────────────────────\n");
	}
	
	static public void ade() {
		System.out.println("                        _       _ ");
		System.out.println("                       ( \\     / )     _________________");
		System.out.println("                        \\ \\___/ /     |    에이드&모히또        |");
		System.out.println("                         ) . . (      |/────────────────   ");
		System.out.println("___________________,--._(___Y___)_,--.______________________________");
		System.out.println("  _______   ________   __________   ___________   _______   ________");
		System.out.println(" ║  커피     ║ ║  논커피    ║ ║ 에이드&모히또 ║ ║ 스무디&프라페  ║ ║   차       ║ ║  디저트    ║");
		System.out.println("     1         2            3            4           5          6  ");
		System.out.println(" ───────────────────────────────────────────────────────────────────\n");
	}
	
	static public void smoothie() {
		System.out.println("                        _       _ ");
		System.out.println("                       ( \\     / )     _________________");
		System.out.println("                        \\ \\___/ /     |    스무디&프라페         |");
		System.out.println("                         ) . . (      |/────────────────   ");
		System.out.println("___________________,--._(___Y___)_,--.______________________________");
		System.out.println("  _______   ________   __________   ___________   _______   ________");
		System.out.println(" ║  커피     ║ ║  논커피    ║ ║ 에이드&모히또 ║ ║ 스무디&프라페  ║ ║   차       ║ ║  디저트    ║");
		System.out.println("     1         2            3            4           5          6  ");
		System.out.println(" ───────────────────────────────────────────────────────────────────\n");
	}
	
	static public void tea() {
		System.out.println("                        _       _ ");
		System.out.println("                       ( \\     / )     _________________");
		System.out.println("                        \\ \\___/ /     |       차                  |");
		System.out.println("                         ) . . (      |/────────────────   ");
		System.out.println("___________________,--._(___Y___)_,--.______________________________");
		System.out.println("  _______   ________   __________   ___________   _______   ________");
		System.out.println(" ║  커피     ║ ║  논커피    ║ ║ 에이드&모히또 ║ ║ 스무디&프라페  ║ ║   차       ║ ║  디저트    ║");
		System.out.println("     1         2            3            4           5          6  ");
		System.out.println(" ───────────────────────────────────────────────────────────────────\n");
	}
	
	static public void dessert() {
		System.out.println("                        _       _ ");
		System.out.println("                       ( \\     / )     _________________");
		System.out.println("                        \\ \\___/ /     |       디저트             |");
		System.out.println("                         ) . . (      |/────────────────   ");
		System.out.println("___________________,--._(___Y___)_,--.______________________________");
		System.out.println("  _______   ________   __________   ___________   _______   ________");
		System.out.println(" ║  커피     ║ ║  논커피    ║ ║ 에이드&모히또 ║ ║ 스무디&프라페  ║ ║   차       ║ ║  디저트    ║");
		System.out.println("     1         2            3            4           5          6  ");
		System.out.println(" ───────────────────────────────────────────────────────────────────\n");
	}
	
	static public void menuBar2() {
		System.out.println("\n───────────────────────────────────────────────────────────────────\n");
		System.out.print("선택할 메뉴를 입력하세요 ᐳᐳ   ");
	}
	static public void optionBar1() {
		System.out.println("\n");
		System.out.println("                 _      _ ");
		System.out.println("                ( \\    / )");
		System.out.println("                 \\ \\__/ /        _________________");
		System.out.println("                 / . .  \\       |  옵션 골라 주시술...? |");
		System.out.println("               _( ㅇ  Y ㅇ   )__    |/──────────────── ");
		System.out.println("______________/ /_________\\ \\________________________");
		System.out.println("              \\_)         (_/");
	}
	
	static public void optionBar2() {
		System.out.println("\n─────────────────────────────────────────────────────\n");
		System.out.print("선택할 옵션을 입력하세요 ᐳᐳ   ");
	}
	
	
	static public void selectMenuBar1() {
		System.out.println();
		System.out.println("	(|_|)   (|_|)   (|_|)   (|_|)     ___________________");
		System.out.println("	('Y')   (':')   (^;^)   ('&')    | 😜장바구니에 담겼습니다😜  |");
		System.out.println("	q . p   d . b   C   C   c . c    |/────────────────── ");
		System.out.println("________()_()___()_()___()_()___()=()________________________\n");
		System.out.println("	1.	메뉴 추가");
		System.out.println("	2.	장바구니로 가기");
		System.out.println("	0.	홈화면");
		System.out.println("\n───────────────────────────────────────────────────────────\n");
		System.out.print(" 선택 >> ");
	}
	
	static public void showcartBar1() {
		 System.out.println("\n                     (\"-^-/\")");
	     System.out.println("                     `o__o' ]     _______________");
	     System.out.println("                     (_Y_) _/    | 장바구니 확인하세요  |");
	     System.out.println("                   _..`--'-.`,   |/──────────────");
	     System.out.println("__________________(__)_,--(__)_________________________\n");
	     
	}
	
	static public void showcartBar2() {
		System.out.print("\n\n──────────────────────────────────────────────────────\n\n");
		System.out.println("\t 1. 더 담기");
		System.out.println("\t 2. 수량 변경");
		System.out.println("\t 3. 결제");
		System.out.println("\t 0. 홈화면");
		System.out.println("\n──────────────────────────────────────────────────────");
		System.out.print(" 선택하세요 >> ");
		
	}
	
	static public void payBar1() {
		System.out.println();
		System.out.println("                 .\".");
        System.out.println("                /  |");
        System.out.println("               /  /");
        System.out.println("              / ,\"");
        System.out.println("   .-------.--- /");
        System.out.println("  \"._ __.-/ o. o\\");
        System.out.println("     \"   (    Y  )");
        System.out.println("          )     /");
        System.out.println("         /     (              _______________");
        System.out.println("        /       Y            | 결제하시겠술...?  |");
        System.out.println("    .-\"         |            |/──────────────");
        System.out.println("   /  _     \\    \\");
        System.out.println("  /    `. \". ) /' )");
        System.out.println(" Y       )( / /(,/");
        System.out.println(" ───────────────────────────────────────────────────\n");
        System.out.println("\t\t 1. 일반결제하기	");
        System.out.println("\t\t 2. 적립금 사용해서 결제하기(회원만 가능)"); 
        System.out.println("\t\t 0. 메인으로\n");
        System.out.println(" ───────────────────────────────────────────────────");
        System.out.print("  선택하세요  >> " );
	}
	
	static public void mileageBar1() {
		System.out.println();
		System.out.println("\t    /\\_/\\            __        ______________");
        System.out.println("\t   = o_o =_______    \\ \\      |  적립금 조회할게요  |");
        System.out.println("\t    __Y      __(  \\.__) )     |/─────────────");
        System.out.println("________(@)<_____>__(_____)____/_______________________\n");
	}
	
	static public void endPrint() {
		System.out.println();
		System.out.println("    ∧ _ ∧");
		System.out.println("　　(・ω・`)                _________________");
		System.out.println("　 _o⌒|⌒c)_____      | 이용해주셔서 감사합니다! |");
		System.out.println(".／　`   ⌒ ⌒     ／||        | ──────────────────|");
		System.out.println("||￣￣￣￣￣||　||");
		System.out.println("||　　　　   ||");
	}
	
}
